/******************************************************************
**	  systick配置文件
********************************************************************/
#include "stm32f10x.h"

static vu32 TimingDelay;

/********************************************************************************************
*函数名称：void Delay(u32 nTime)
*
*入口参数：u32 nTime:延时时间
*
*出口参数：无
*
*功能说明：SYSTICK滴答延时配置
*******************************************************************************************/
void Delay(u32 nTime)
{
  SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);	//时钟源选择
  SysTick_Config(72000);								//调置产生中断的计数个数

  TimingDelay = nTime;
  while(TimingDelay != 0);
}
/********************************************************************************************
*函数名称：void Systick_IRQ(void)
*
*入口参数：无
*
*出口参数：无
*
*功能说明：SYSTICK滴答中断处理函数
*******************************************************************************************/
void Systick_IRQ(void)
{
  if (TimingDelay != 0x00)
  { 
    TimingDelay--;
  }
}
